In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.read_csv("movie_scores.csv")
print(df)

  first_name last_name   age gender  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0      m              8.0              10.0
1        NaN       NaN   NaN    NaN              NaN               NaN
2       Hugh   Jackman  51.0      m              NaN               NaN
3      Oprah   Winfrey  66.0      f              6.0               8.0
4       Emma     Stone  31.0      f              7.0               9.0

In [3]:
#Chcecking and selecting for null values
print(df.isnull())
print(df.notnull())

   first_name  last_name    age  gender  pre_movie_score  post_movie_score
0       False      False  False   False            False             False
1        True       True   True    True             True              True
2       False      False  False   False             True              True
3       False      False  False   False            False             False
4       False      False  False   False            False             False
   first_name  last_name    age  gender  pre_movie_score  post_movie_score
0        True       True   True    True             True              True
1       False      False  False   False            False             False
2        True       True   True    True            False             False
3        True       True   True    True             True              True
4        True       True   True    True             True              True

In [4]:
print(df["first_name"])
print(df["first_name"].notnull())

0      Tom
1      NaN
2     Hugh
3    Oprah
4     Emma
Name: first_name, dtype: object
0     True
1    False
2     True
3     True
4     True
Name: first_name, dtype: bool

In [5]:
print(df[(df['pre_movie_score'].isnull()) & df['gender'].notnull()])

  first_name last_name   age gender  pre_movie_score  post_movie_score
2       Hugh   Jackman  51.0      m              NaN               NaN

In [6]:
#dropna
print(df.dropna())

  first_name last_name   age gender  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0      m              8.0              10.0
3      Oprah   Winfrey  66.0      f              6.0               8.0
4       Emma     Stone  31.0      f              7.0               9.0

In [7]:
print(df.dropna(thresh=1))

  first_name last_name   age gender  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0      m              8.0              10.0
2       Hugh   Jackman  51.0      m              NaN               NaN
3      Oprah   Winfrey  66.0      f              6.0               8.0
4       Emma     Stone  31.0      f              7.0               9.0

In [8]:
print(df.dropna(axis=1))

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [10]:
print(df.dropna(thresh=4,axis=1))

  first_name last_name   age gender
0        Tom     Hanks  63.0      m
1        NaN       NaN   NaN    NaN
2       Hugh   Jackman  51.0      m
3      Oprah   Winfrey  66.0      f
4       Emma     Stone  31.0      f

In [12]:
#fill value
df.fillna("New Value!")

print(df["first_name"].fillna("Empty"))
df['first_name']=df["first_name"].fillna("Empty")

0      Tom
1    Empty
2     Hugh
3    Oprah
4     Emma
Name: first_name, dtype: object

In [13]:
#Fills null values with average
print(df['pre_movie_score'].mean())
df['pre_movie_score'].fillna(df['pre_movie_score'].mean())

7.0

0    8.0
1    7.0
2    7.0
3    6.0
4    7.0
Name: pre_movie_score, dtype: float64

In [14]:
'''
grouping functionality:
1. Splitting: the data is first  split into groups baseed on the criteria prvoded
2. Applying: A function  (or multiple function ) is applied to each group independently
3. Combining : the result of the function application combine into a new dataframe
'''
df=pd.read_csv("tips.csv")
print(df)

     total_bill   tip  gender smoker   day    time  size  price_per_person  \
0         16.99  1.01  Female     No   Sun  Dinner     2              8.49
1         10.34  1.66    Male     No   Sun  Dinner     3              3.45
2         21.01  3.50    Male     No   Sun  Dinner     3              7.00
3         23.68  3.31    Male     No   Sun  Dinner     2             11.84
4         24.59  3.61  Female     No   Sun  Dinner     4              6.15
..          ...   ...     ...    ...   ...     ...   ...               ...
239       29.03  5.92    Male     No   Sat  Dinner     3              9.68
240       27.18  2.00  Female    Yes   Sat  Dinner     2             13.59
241       22.67  2.00    Male    Yes   Sat  Dinner     2             11.34
242       17.82  1.75    Male     No   Sat  Dinner     2              8.91
243       18.78  3.00  Female     No  Thur  Dinner     2              9.39

             Payer Name     CC Number Payment ID
0    Christy Cunningham  3.560330e+15    Sun2959
1        Douglas Tucker  4.478070e+15    Sun4608
2        Travis Walters  6.011810e+15    Sun4458
3      Nathaniel Harris  4.676140e+15    Sun5260
4          Tonya Carter  4.832730e+15    Sun2251
..                  ...           ...        ...
239       Michael Avila  5.296070e+15    Sat2657
240      Monica Sanders  3.506810e+15    Sat1766
241          Keith Wong  6.011890e+15    Sat3880
242        Dennis Dixon  4.375220e+12      Sat17
243     Michelle Hardin  3.511450e+15    Thur672

[244 rows x 11 columns]

In [17]:
#1.Spliting
df_grouped = df.groupby("gender")
print(df_grouped.head())

    total_bill   tip  gender smoker  day    time  size  price_per_person  \
0        16.99  1.01  Female     No  Sun  Dinner     2              8.49
1        10.34  1.66    Male     No  Sun  Dinner     3              3.45
2        21.01  3.50    Male     No  Sun  Dinner     3              7.00
3        23.68  3.31    Male     No  Sun  Dinner     2             11.84
4        24.59  3.61  Female     No  Sun  Dinner     4              6.15
5        25.29  4.71    Male     No  Sun  Dinner     4              6.32
6         8.77  2.00    Male     No  Sun  Dinner     2              4.38
11       35.26  5.00  Female     No  Sun  Dinner     4              8.82
14       14.83  3.02  Female     No  Sun  Dinner     2              7.42
16       10.33  1.67  Female     No  Sun  Dinner     3              3.44

            Payer Name     CC Number Payment ID
0   Christy Cunningham  3.560330e+15    Sun2959
1       Douglas Tucker  4.478070e+15    Sun4608
2       Travis Walters  6.011810e+15    Sun4458
3     Nathaniel Harris  4.676140e+15    Sun5260
4         Tonya Carter  4.832730e+15    Sun2251
5           Erik Smith  2.131400e+14    Sun9679
6   Kristopher Johnson  2.223730e+15    Sun5985
11        Diane Macias  4.577820e+15    Sun6686
14       Vanessa Jones  3.001670e+13    Sun3848
16    Elizabeth Foster  4.240030e+15    Sun9715

In [18]:
#2.Applying
#calculate the mean tip for each gender
mean_tip_by_gender= df_grouped['tip'].mean()
print(mean_tip_by_gender)

gender
Female    2.833448
Male      3.089618
Name: tip, dtype: float64

In [21]:
print(df_grouped['tip'].min())
print(df_grouped['tip'].max())
print(df_grouped['tip'].std())
print(df_grouped['tip'].var())
print(df_grouped['tip'].count())
print(df_grouped['tip'].sum())

gender
Female    1.0
Male      1.0
Name: tip, dtype: float64
gender
Female     6.5
Male      10.0
Name: tip, dtype: float64
gender
Female    1.159495
Male      1.489102
Name: tip, dtype: float64
gender
Female    1.344428
Male      2.217424
Name: tip, dtype: float64
gender
Female     87
Male      157
Name: tip, dtype: int64
gender
Female    246.51
Male      485.07
Name: tip, dtype: float64

In [22]:
#Creating Groups for multiple columns
df_grouped=df.groupby(['gender','day'])

In [23]:
#3 Combining also konwn as Drill-down
mean_tip_by_gender_day=df_grouped['tip'].mean()
print(mean_tip_by_gender_day)

gender  day
Female  Fri     2.781111
        Sat     2.801786
        Sun     3.367222
        Thur    2.575625
Male    Fri     2.693000
        Sat     3.083898
        Sun     3.220345
        Thur    2.980333
Name: tip, dtype: float64

In [24]:
#agg function
#apply multiple aggregation functions to differenet columns when grouping data
#Claculate both the mean and the sum if the 'tip' column for each combinaton of 'gender' & 'day'

#Group the DataFrame by both "gender" and "day" and calculate the mean and the sum of the "tip" for each combination
df_grouped=df.groupby(['gender','day']).agg({'tip':['mean','sum']}).reset_index()

In [25]:
df_grouped.columns=["gender",'day','mean_tip','total_tip']
print(df_grouped.head())

   gender   day  mean_tip  total_tip
0  Female   Fri  2.781111      25.03
1  Female   Sat  2.801786      78.45
2  Female   Sun  3.367222      60.61
3  Female  Thur  2.575625      82.42
4    Male   Fri  2.693000      26.93